Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: གསེར་གྱི་རང་བཞིན་གྱི་ཞིང་རྣམས་སུ་འོད་ཨ་སྨ་གརྦྷའི་ཁ་དོག་ཅན་རབ་ཏུ་འགྱེད་པ་དང་། ཨིན་དྲ་ནཱི་ལའི་རང་བཞིན་གྱི་ཞིང་རྣམས་སུ་འོད་རིན་པོ་ཆེའི་རྒྱལ་པོ་ཉི་མའི་སྙིང་པོའི་ཁ་དོག་ཅན་རབ་ཏུ་འགྱེད་པ་དང་། རིན་པོ་ཆེའི་རྒྱལ་པོ་ཉི་མའི་སྙིང་པོའི་རང་བཞིན་གྱི་ཞིང་རྣམས་སུ་འོད་རིན་པོ་ཆེའི་རྒྱལ་པོ་ཨིན་དྲ་ནཱི་ལའི་ཁ་དོག་ཅན་རབ་ཏུ་འགྱེད་པ་དང་། མུ་ཏིག་དམར་པོའི་རང་བཞིན་གྱི་ཞིང་རྣམས་སུ་འོད་རིན་པོ་ཆེའི་རྒྱལ་པོ་ཟླ་བའི་འོད་ཟེར་གྱི་དྲ་བ་དང་དཀྱིལ་འཁོར་གྱི་སྙིང་པོའི་ཁ་དོག་ཅན་རབ་ཏུ་འགྱེད་པ་དང་། རིན་པོ་ཆེའི་རྒྱལ་པོ་ཟླ་བའི་འོད་ཟེར་གྱི་དྲ་བ་དང་དཀྱིལ་འཁོར་གྱི་སྙིང་པོའི་རང་བཞིན་གྱི་ཞིང་རྣམས་སུ་འོད་མུ་ཏིག་དམར་པོའི་ཁ་དོག་ཅན་རབ་ཏུ་འགྱེད་པ་དང་། རིན་པོ་ཆེ་གཅིག་གི་རང་བཞིན་གྱི་ཞིང་རྣམས་སུ་འོད་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཁ་དོག་ཅན་རབ་ཏུ་འགྱེད་པ་དང་། རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་རང་བཞིན་གྱི་ཞིང་རྣམས་སུ་འོད་རིན་པོ་ཆེ་གཅིག་གི་ཁ་དོག་ཅན་རབ་ཏུ་འགྱེད་པ་དང་། དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་དུ་སེམས་ཅན་གྱི་དོན་ཚད་མེད་པ་ལ་བརྩོན་ཞིང་ཆོས་ཀྱི་དབྱིངས་རྒྱས་པར་འགེངས་པ་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་མཐོང་ངོ་། །
en: Sudhana saw, issuing forth from Sāgara­dhvaja’s eyes, hundreds of thousands of sun disks as numerous as the atoms in countless buddha realms, filling the realm of phenomena of all beings and illuminating all the great hells, dispelling darkness in the world; eliminating the darkness of ignorance within beings; bringing to an end the suffering of cold experienced by the beings in the cold hells; shining white light rays over the realms that are made of earth; shining light rays the color of beryl over the realms that are made of gold; shining light rays the color of gold over the realms that are made of beryl; shining light rays the color of silver over the realms that are made of gold; shining light rays the color of gold over the realms that are made of silver; shining light rays the color of crystal over the realms that are made of gold; shining light rays the color of gold over the realms that are made of crystal; shining light rays the color of white coral over the realms that are made of gold; shining light rays the color of gold over the realms that are made of white coral; shining light rays the color of gold over the realms that are made of red pearls; shining light rays the color of red pearls over the realms that are made of gold; shining light rays the color of gold over the realms that are made of emerald; shining light rays the color of emerald over the realms that are made of gold; shining light rays the color of sunstones, the kings of jewels, over the realms that are made of sapphire; shining light rays the color of sapphires, the kings of jewels, over the realms that are made of sunstones, the kings of jewels; shining light rays the color of the kings of jewels, the essences of the disk of the aggregation of moonstones, over the realms that are made of red pearls; shining light rays the color of red pearls over the realms that are made of the kings of jewels, the essences of the disk of the aggregation of moonstones; shining light rays that have the colors of various kinds of jewels over the realms that are made of a single kind of jewel; and shining light rays that have the color of a single kind of jewel over the realms that are made of various kinds of jewels; thus engaging in measureless activities for beings within all the assemblies of pupils of bodhisattvas.

source: སྨིན་མཚམས་ཀྱི་མཛོད་སྤུ་ནས་ཟླ་བ་མང་པོ་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་ནས། ལྷའི་དབང་པོ་ཐམས་ཅད་ཟིལ་གྱིས་གནོན་ཅིང་། འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་འདོད་པའི་དགའ་བ་རྣམ་པར་བཟློག་པ་དང་། སངས་རྒྱས་བལྟ་བར་དགའ་བ་ལ་རྗེས་སུ་བསྔགས་པ་བྱེད་ཅིང་། སེམས་ཅན་ཚད་མྱེད་པ་གདུལ་བ་ལ་བརྩོན་པར་ཕྱོགས་བཅུའི་ཆོས་ཀྱི་དབྱིངས་རྒྱས་པར་འགེངས་པར་མཐོང་ངོ་། །འཕྲལ་བ་ནས་ཚངས་པ་ཆེན་པོ་སྤྱོད་ལམ་རབ་ཏུ་ཞི་བ་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་བ་ནས།
en: Sudhana saw, issuing forth from the ūrṇā hair between Sāgara­dhvaja’s eyebrows, a multitude of moons as numerous as the atoms in countless buddha realms, filling the ten directions of the realm of phenomena and overpowering all lords of devas, turning all the world away from delighting in desires, praising delight in seeing the buddhas, and dedicated to guiding measureless beings.

source: ཚངས་པའི་དབྱངས་སུ་བརྗོད་དེ། སངས་རྒྱས་ཐམས་ཅད་ལ་གསོལ་བ་གདབ་པ་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་རབ་ཏུ་དགའ་བར་བྱ་བ་བྱེད་ཅིང་སེམས་ཅན་གྱི་དོན་ཚད་མེད་པ་ལ་བརྩོན་པར་ཕྱོགས་བཅུའི་ཆོས་ཀྱི་དབྱིངས་རྒྱས་པར་འགེངས་པ་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་མཐོང་ངོ་། །
en: Sudhana saw, issuing forth from the Sāgara­dhvaja’s forehead, Mahābrahmās as numerous as the atoms in countless buddha realms, filling the ten directions of the realm of phenomena, who had a peaceful deportment, spoke with the voice of Brahmā, supplicated all the buddhas for instruction, eulogized all the buddhas, gladdened all bodhisattvas, and were dedicated to measureless benefit for beings.

source: མགོ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་ནས། ཁ་དོག་དང་དབྱིབས་སྣ་ཚོགས་ཀྱིས་བརྒྱན་པའི་ལུས་ཡོངས་སུ་སྟོན་ཅིང་། དཔེ་བྱད་བཟང་པོས་རྣམ་པར་བྲིས་པའི་ལུས་རབ་ཏུ་སྟོན་པ་དང་། འོད་ཀྱི་དཀྱིལ་འཁོར་གྱི་སྤྲིན་མཐའ་དང་དབུས་མེད་པ་རབ་ཏུ་དགྱེ་བ་དང་། བ་སྤུའི་བུ་ག་ཐམས་ཅད་ནས་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སྔོན་གྱི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ནས་བཟུང་སྟེ། གཏོང་བ་དང་ལེན་པ་དང་། དངོས་པོ་ཡོངས་སུ་གཏོང་བའི་སྤྲིན་མང་པོ་རབ་ཏུ་དགྱེ་བ་དང་།
en: Sudhana saw, issuing forth from Sāgara­dhvaja’s head, bodhisattvas as numerous as the atoms in countless buddha realms, filling in each instant of mind the ten directions of the realm of phenomena, manifesting bodies that had various colors, forms, and adornments, revealing bodies beautified by the features of a great being, and emanating infinite clouds of halos.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་སྣ་ཚོགས་དང་ལྡན་པའི་སྔོན་གྱི་སྦྱོར་བ་རྒྱ་མཚོ་ཡོངས་སུ་བསྟན་པ་དང་། སྦྱིན་པའི་སྤྱོད་པ་འཇིག་རྟེན་དུ་ཡོངས་སུ་བརྗོད་པ་དང་། སེར་སྣའི་དྲི་མ་རྣམ་པར་བཟློག་པ་དང་། ཆགས་པ་ཐམས་ཅད་སྤང་བ་ལ་སེམས་ཅན་རབ་ཏུ་དགོད་པ་དང་། འཇིག་རྟེན་རིན་པོ་ཆེ་སྣ་ཚོགས་ཐམས་ཅད་ཀྱི་རྒྱན་གྱིས་བརྒྱན་པར་བྱིན་གྱིས་བརླབ་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སེམས་ཅན་རབ་ཏུ་དགོད་པ་དང་།
en: From all their pores there commenced the emanation of the past bodhisattva conduct of all buddhas, revealing clouds of the processes of acts of generosity with their givers, recipients, and gifts; revealing an ocean of the previous practices of the various perfections; describing the conduct of generosity to the world; averting the stains of greed; bringing beings to the renunciation of all attachments; blessing worlds with an adorning array of every variety of jewel; establishing beings in the perfection of generosity and then establishing them in the power over necessities; proclaiming the qualities of all characteristics of a supreme being; and teaching the causes for the arising of those features of a buddha.

source: མཚན་ཐམས་ཅད་ཀྱི་ཡོན་ཏན་ཡང་དག་པར་བརྗོད་པ་དང་། སངས་རྒྱས་ཀྱི་མཚན་འབྱུང་བའི་རྒྱུ་སྟོན་པ་བྱེད་པ་མཐོང་ངོ་། །ཡང་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མྱེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་ནས། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་བརྗོད་ཅིང་། བ་སྤུའི་བུ་ག་ཐམས་ཅད་ནས་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་ལྡན་པའི་སྔོན་གྱི་སྦྱོར་བ་རྒྱ་མཚོ་ཡོངས་སུ་བསྟན་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ལམ་གྱི་རྒྱུད་དང་ཡུལ་ལས་ཕྱིར་ཕྱོགས་པར་བྱས་ཏེ། དེ་བཞིན་གཤེགས་པའི་ཡུལ་ལ་མངོན་དུ་ཕྱོགས་པར་བྱ་བ་དང་། འཇིག་རྟེན་གྱི་འདོད་པ་ལ་རྣམ་པར་སྨད་པ་དང་།
en: Sudhana saw bodhisattvas issuing forth who were as numerous as the atoms in countless buddha realms and were describing the perfection of good conduct manifesting from all their pores, an ocean of the past practice by all the buddhas of the perfection of good conduct.

source: འཇིག་རྟེན་གྱི་ཕྱིན་ཅི་ལོག་གི་ལིང་ཏོག་རྣམ་པར་བསལ་བ་དང་། ལོག་པའི་རྣམ་པར་རྟོག་པ་རབ་ཏུ་ཞི་བར་བྱས་ནས་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་ལ་ཡང་དག་པར་དགོད་པ་དང་། སྙིང་རྗེ་ཆེན་པོའི་ཚུལ་ཁྲིམས་ཡོངས་སུ་བརྗོད་ཅིང་དེ་བཞིན་གཤེགས་པའི་ཚུལ་ཁྲིམས་རབ་ཏུ་ཐོབ་པར་བྱ་བའི་ཕྱིར། སངས་རྒྱས་ཀྱི་ལམ་ནན་ཏན་དུ་བྱ་བའི་ཚུལ་ཁྲིམས་ལ་སེམས་ཅན་རབ་ཏུ་དགོད་པ་དང་། སྲིད་པའི་ལམ་གྱི་རྒྱུད་རྨི་ལམ་ལྟ་བུར་སེམས་ཅན་རྣམས་ལ་རབ་ཏུ་བརྗོད་ཅིང་། རྨི་ལམ་གྱི་ཚུལ་དང་མཉམ་པར་ཡོངས་སུ་གཞོལ་བར་བྱ་བའི་ཕྱིར་ཡུལ་ཡོངས་སུ་འཛིན་པ་དང་ཉོན་མོངས་པ་ལ་དབང་བསྒྱུར་བར་སེམས་ཅན་རྣམས་རབ་ཏུ་དགོད་པ་བྱེད་པ་མཐོང་ངོ་། །
en: They were causing all beings to turn away from the entire field of existences and worlds and directing them to the field of the tathāgatas; they were deploring the world of desire; they were removing the cataracts of error in the world; they were bringing an end to erroneous thought and establishing beings in the correct conduct of the bodhisattvas; they were describing the correct conduct of great compassion and establishing beings in the correct conduct of practicing the path of the buddhas so that they might attain the correct conduct of the tathāgatas; they were describing to beings how the states of existence are like dreams; and they were establishing beings in a state of overpowering the kleśas and attachment to the field of the senses in order that they might attain the state of perceiving all to be the same as the way of dreams.

source: ཡང་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་ནས། འཇིག་རྟེན་རྣམས་ལ་མདོག་གསེར་གྱི་ཁ་དོག་ལྟ་བུ་མངོན་པར་སྟོན་ཅིང་། ཁྲོ་བ་མེད་པ་དང་།
en: Sudhana also saw bodhisattvas issuing forth who were as numerous as the atoms in countless buddha realms and were revealing worlds to be golden in color.

source: འཁྲུག་པ་མེད་པ་དང་། ཤར་གཉེར་བ་མེད་པ་དང་། ཞེ་སྡང་བ་མེད་པ་དང་། ཆུད་གསོན་པ་མེད་པ་དང་། ཁོང་ཁྲོ་བ་མེད་པའི་སེམས་ལ་སེམས་ཅན་རབ་ཏུ་དགོད་པ་དང་།
en: They were establishing beings in having no anger and no vexation and in states of mind that are without harshness, without hatred, nondestructive, and free of hostility.

source: བྱོལ་སོང་གི་སྐྱེ་གནས་ཀྱི་ལམ་གྱི་རྒྱུད་ཐམས་ཅད་ཡོངས་སུ་གཅོད་པའི་ཕྱིར། བ་སྤུའི་སྒོ་ཐམས་ཅད་ནས་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་ལྡན་པའི་དེ་བཞིན་གཤེགས་པའི་སྔོན་གྱི་སྦྱོར་བའི་སྤྲིན་རབ་ཏུ་འགྱེད་ཅིང་བཟོད་པའི་སྟོབས་ལ་སེམས་ཅན་རབ་ཏུ་དགོད་པ་དང་། ཆོས་ལ་དབང་བསྒྱུར་བ་ལ་སེམས་ཅན་རབ་ཏུ་སྣང་བར་བྱེད་པ་མཐོང་ངོ་། །
en: In order to close the ways to animal wombs, they were manifesting from all their pores clouds of the past practice by the tathāgatas of dedication to the perfection of patience, and they were establishing beings in the power of patience and revealing to beings power over phenomena.

source: ཡང་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་སྟེ། བྱང་ཆུབ་སེམས་དཔའི་བརྩོན་འགྲུས་ཀྱི་སྟོབས་མཐའ་ཡས་པ་ཤིན་ཏུ་སྟོན་ཅིང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་བརྩམས་པ་ལས་ཕྱིར་མྱི་ལྡོག་པའི་སྟོབས་ཀྱིས་ཐོས་པ་རྒྱ་མཚོ་ཡོངས་སུ་བཙལ་བས་མི་སྐྱོ་བར་བྱ་བ་ཡོངས་སུ་བརྗོད་པ་དང་།
en: Sudhana also saw bodhisattvas issuing forth who were as numerous as the atoms in countless buddha realms, who were revealing the infinite power of the diligence of bodhisattvas, and who were describing how, through the power of never turning back from striving for omniscience, were never weary in seeking for an ocean of hearing the Dharma.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མཆོད་ཅིང་རིམ་གྲོ་བྱ་བ་ལ་སེམས་ཅན་རབ་ཏུ་གཟུད་པ་དང་། སྡུག་བསྔལ་གྱི་ཕུང་པོ་ཐམས་ཅད་རྣམ་པར་བཟློག་པའི་བརྩོན་འགྲུས་ཆེན་པོ་ལ་སེམས་ཅན་རབ་ཏུ་དགོད་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་ལྡན་པའི་སྔོན་གྱི་སྦྱོར་བ་མང་པོའི་སྤྲིན་ལུས་ཐམས་ཅད་ལས་རབ་ཏུ་འགྱེད་ཅིང་བྱང་ཆུབ་སེམས་དཔའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྤྱོད་པ་ཡོངས་སུ་བསྟན་པ་དང་། སེམས་ཅན་རྣམས་ཀྱི་ལེ་ལོའི་རི་རྣམ་པར་གཏོར་བ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སེམས་ཅན་རབ་ཏུ་དགོད་པ་དང་ལས་ལ་དབང་བསྒྱུར་བ་ལ་འཇིག་རྟེན་རབ་ཏུ་གཟུད་པ་དང་།
en: They were causing beings to engage in serving and making offerings to all the tathāgatas; establishing beings in the great diligence that repels the entire mass of suffering; emanating all the clouds of the bodies of the past practice by the tathāgatas of dedication to the perfection of diligence; teaching the perfection of diligence of the bodhisattvas; disintegrating the mountains of the laziness of beings; establishing beings in the perfection of patience; and leading the world to power over karma, fixed in their resolve.

source: རྒྱུན་མི་ཆད་པར་བརྩོན་པར་བྱེད་པ་མཐོང་ངོ་། །ཡང་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་ནས། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རྗེས་སུ་དྲན་པའི་ལམ་ལ་སེམས་ཅན་ཐམས་ཅད་རབ་ཏུ་དགོད་ཅིང་སྒྲིབ་པ་དང་། བར་དུ་གཅོད་པ་དང་། རབ་རིབ་ཐམས་ཅད་རྣམ་པར་སེལ་བ་དང་། རློམ་པ་དང་བག་མེད་པ་ཐམས་ཅད་ལས་སེམས་ཅན་རྣམ་པར་བཟློག་པ་དང་། བག་ཡོད་པའི་ཆོས་ལ་རབ་ཏུ་དགོད་པ་དང་།
en: Sudhana also saw bodhisattvas issuing forth who were as numerous as the atoms in countless buddha realms, were filling the realm of phenomena in each instant of mind, and were establishing beings on the path of mindfulness of the bodhisattvas.

source: ཁེངས་པ་འགྱིང་བ་དང་། ང་རྒྱལ་གྱི་རྒྱལ་མཚན་རབ་ཏུ་སྙོལ་བ་དང་། སངས་རྒྱས་ཀྱི་བསམ་གཏན་གྱི་ཡན་ལག་རྒྱ་མཚོ་བརྗོད་པ་དང་། འཇིག་རྟེན་རྣམས་ལ་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་བསྔགས་པ་དང་། བ་སྤུའི་བུ་ག་ཐམས་ཅད་ནས་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་ལྡན་པའི་སྔོན་གྱི་ཚུལ་མང་པོའི་སྤྲིན་རབ་ཏུ་དགྱེ་བ་དང་།
en: They were eliminating all obscurations, obstacles, and darkness; turning beings away from all conceit and carelessness; establishing them in the qualities of carefulness; casting down the banner of arrogance, haughtiness, and pride; describing an ocean of aspects of the meditation of the buddhas; praising the perfection of meditation to the world; emanating from all their pores clouds of the many past practices by the tathāgatas of the perfection of meditation; and establishing beings in power over mind.

source: སེམས་ལ་དབང་བསྒྱུར་བ་ལ་སེམས་ཅན་རབ་ཏུ་དགོད་པ་བྱེད་ཅིང་སྐད་ཅིག་རེ་རེ་ལ་ཆོས་ཀྱི་དབྱིངས་རྒྱས་པར་འགེངས་པ་མཐོང་ངོ་། །ཡང་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་སྟེ། བ་སྤུའི་བུ་ག་ཐམས་ཅད་ནས་སངས་རྒྱས་ཀྱི་ཆོས་ཡོངས་སུ་ཚོལ་བ་དང་ལྡན་པའི་སྔོན་གྱི་སྦྱོར་བ་མང་པོའི་སྤྲིན་རབ་ཏུ་དགྱེ་བ་དང་།
en: Sudhana also saw bodhisattvas issuing forth who were as numerous as the atoms in countless buddha realms, were filling the realm of phenomena in each instant of mind, and were emanating from all their pores clouds of the many past practices by the tathāgatas of seeking the Dharma.

source: དབྱངས་ཀྱི་ཡན་ལག་རྒྱ་མཚོའི་སྐད་ཐམས་ཅད་ཀྱིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྤྲིན་གྱི་འབྲུག་སྒྲ་སྒྲོག་པ་དང་། ཡང་དག་པར་ལྟ་བའི་གློག་རབ་ཏུ་འགྱེད་པ་དང་། ཆོས་ཀྱི་རང་བཞིན་གྱི་སྒྲ་དབྱངས་རབ་ཏུ་བསྒྲག་པ་དང་། སེམས་ཅན་རྣམས་ཀྱི་བདག་ཏུ་ལྟ་བའི་རིའི་ལྷུན་རབ་ཏུ་གཞིག་པ་དང་། ལྟ་བ་ཐམས་ཅད་ཀྱི་ཟུག་རྔུ་དབྱུང་བ་དང་། ཐེ་ཙོམ་དང་ཡིད་གཉིས་དང་ནེམ་ནུར་གྱི་རབ་རིབ་རྣམ་པར་བསྩལ་བ་དང་།
en: With all languages, which are an ocean of the aspects of speech, they emitted the thunder of the clouds of the perfection of wisdom; radiated the lightning of the correct view; resounded with the words on the nature of phenomena; destroyed the mountains of the view of a self held by beings; extracted the splinters of all wrong views; cleared away doubts, uncertainties, and equivocation; and praised power over motivation.

source: ཡེ་ཤེས་ཀྱི་དབང་ཡང་དག་པར་བསྔགས་པ་བྱེད་ཅིང་། སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ཆོས་ཀྱི་དབྱིངས་རྒྱས་པར་འགེངས་པ་མཐོང་ངོ་། །ཡང་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་ནས། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཐབས་མཁས་པའི་ཚུལ་གྱི་དཀྱིལ་འཁོར་རབ་ཏུ་བརྗོད་པ་བྱེད་ཅིང་བ་སྤུའི་བུ་ག་ཐམས་ཅད་ནས་ཐབས་མཁས་པ་དང་ལྡན་པའི་སྔོན་གྱི་སྦྱོར་བ་མང་པོའི་སྤྲིན་རབ་ཏུ་དགྱེ་བ་དང་།
en: Sudhana also saw bodhisattvas issuing forth who were as numerous as the atoms in countless buddha realms, were filling the realm of phenomena in each instant of mind and describing the field of the way of skillful methods of all the buddhas.

source: འཇིག་རྟེན་རྣམས་ལ་ཐབས་མཁས་པའི་སྤྱོད་པ་རབ་ཏུ་བརྗོད་པ་དང་། ཐེག་པ་ཆེན་པོའི་འབྱུང་བ་མངོན་པར་བསྟན་པ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་དཀྱིལ་འཁོར་ཡང་དག་པར་བསྔགས་པ་དང་། འཁོར་བ་དང་མྱ་ངན་ལས་འདས་པ་ཐ་མྱི་དད་པའི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡོངས་སུ་བསྟན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཐབས་མཁས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སེམས་ཅན་རབ་ཏུ་དགོད་པ་དང་།
en: They were emanating from all their pores clouds of the many past practices by the tathāgatas of skillful methods for all beings, revealing the conduct of skillful methods to the world, explaining skill in the Mahāyāna, praising the fields of all the buddhas, teaching the bodhisattva conduct in which there is no separation between saṃsāra and nirvāṇa, establishing beings in the perfection of skillful methods of the bodhisattvas, and teaching the bodhisattva field of power over rebirth to the world.

source: འཇིག་རྟེན་རྣམས་ལ་བྱང་ཆུབ་སེམས་དཔའི་དབང་གི་དཀྱིལ་འཁོར་རབ་ཏུ་བསྟན་པ་བྱེད་ཅིང་། སེམས་བསྐྱེད་པ་རེ་རེ་ལ་ཆོས་ཀྱི་དབྱིངས་རྒྱས་པར་འགེངས་པ་མཐོང་ངོ་། །ཡང་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་སྟེ། བ་སྤུའི་བུ་ག་ཐམས་ཅད་ནས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་མཚན་རྒྱ་མཚོའི་སྤྲིན་གྱི་འབྲུག་སྒྲ་སྒྲོག་ཅིང་། བ་སྤུའི་བུ་ག་ཐམས་ཅད་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྨོན་ལམ་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་དག་པ་དང་ལྡན་པའི་སྔོན་གྱི་སྦྱོར་བ་མང་པོའི་སྤྲིན་རབ་ཏུ་དགྱེ་བ་དང་།
en: Sudhana also saw bodhisattvas issuing forth who were as numerous as the atoms in countless buddha realms, were filling the realm of phenomena in each instant of mind through the miraculous power of prayer, and were emanating from all their pores the thunder of the clouds of the ocean of the names of all tathāgatas.

source: སྨོན་ལམ་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་དག་པར་བསྔགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་དབང་ཐམས་ཅད་ལ་སེམས་ཅན་རབ་ཏུ་དགོད་པ་དང་། སྨོན་ལམ་ཆེན་པོའི་ཤིང་རྟའི་འཁོར་ལོ་ཕྱི་མའི་མཐའི་མུར་ཐུག་པར་འདྲིལ་བ། ཆོས་ཐམས་ཅད་ཀྱི་རྗེས་སུ་འབྲང་བ་ཉོན་མོངས་པ་ཐམས་ཅད་རྣམ་པར་བཟློག་པ། མི་ཤེས་པའི་རི་རྣམ་པར་འཐོར་བ། འཇིག་རྟེན་དུ་རབ་ཏུ་བརྗོད་པ་བྱེད་ཅིང་། སྨོན་ལམ་སྣ་ཚོགས་ཀྱི་རྣམ་པར་འཕྲུལ་པས།
en: They were emanating from all their pores clouds of the many past practices of the pure perfection of prayer of all bodhisattvas; they were praising the perfection of prayer, establishing beings in all the powers of the bodhisattvas; and they were teaching to the world the rolling of the wheels of the chariot of great prayer until the end of future time, the following of all Dharmas, the repelling of all kleśas, and the destruction of the mountains of ignorance.

source: སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ཆོས་ཀྱི་དབྱིངས་རྒྱས་པར་འགེངས་པ་མཐོང་ངོ་།། །།སངས་རྒྱས་རྨད་གཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ། །བམ་པོ་སུམ་ཅུ་པ། ཡང་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་སྟེ། བྱང་ཆུབ་སེམས་དཔའི་སྟོབས་རབ་ཏུ་སྣང་བར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྟོབས་ཡོངས་སུ་བསྒྲུབ་པའི་སྒྲ་རབ་ཏུ་དབྱུང་བ་དང་།
en: Sudhana also continuously saw bodhisattvas issuing forth who were as numerous as the atoms in countless buddha realms, filling the realm of phenomena in each instant of mind, and illuminating the strength of the bodhisattvas.

source: བ་སྤུའི་བུ་ག་ཐམས་ཅད་ནས་སྟོབས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒྲུབ་ཅིང་འབྱིན་པའི་སྔོན་གྱི་སྦྱོར་བ་མང་པོའི་སྤྲིན་རབ་ཏུ་དགྱེ་བ་དང་། བདུད་དང་ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་ཀྱིས་མི་ཐུབ་པའི་སྟོབས་ཡོངས་སུ་བསྟན་པ་དང་། ཁོར་ཡུག་དང་རྡོ་རྗེའི་རི་ཐམས་ཅད་ལུས་ཀྱི་སྟེང་དུ་རྡིབ་ཀྱང་མི་ཉམས་པའི་སྟོབས་རབ་ཏུ་བརྗོད་པ་དང་། བསྐལ་པས་ཚིག་པ་ཐམས་ཅད་ཀྱི་མེ་རྒྱ་མཚོའི་ནང་ན་གནས་ཀྱང་ལུས་ལ་གནོད་པ་མེད་པའི་སྟོབས་ཡོངས་སུ་བསྟན་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་འབྱམ་ཀླས་པ་ཐམས་ཅད་ལག་པའི་མཐིལ་གྱི་ནམ་མཁའི་དབྱིངས་སུ་སྟོན་པའི་སྟོབས་ཡོངས་སུ་སྟོན་པ་བྱེད་ཅིང་།
en: They were emitting the sound of the words of the accomplishment of the strength of the bodhisattvas; emanating from all their pores the clouds of the many past practices by the tathāgatas of the accomplishment and creation of the perfection of strength; teaching the strength that cannot be defeated by all the māras and adversaries; describing the strength that is not weakened even if all Cakravāla vajra mountain ranges were to drop down onto their bodies; teaching the strength with which their bodies will not be harmed even though they remain in an ocean of the fires that incinerate all kalpas; teaching the strength by which one can hold up in the sky, on the palm of the hand, all the vast extent of world realms; and establishing beings in the power over miracles.

source: སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ཆོས་ཀྱི་དབྱིངས་སུ་འགེངས་པས་རྒྱུན་མི་གཅོད་པ་མཐོང་ངོ་། །ཡང་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་ནས། སེམས་ཅན་རྣམས་ལ་ཡེ་ཤེས་ཀྱི་དཀྱིལ་འཁོར་སྟོན་ཅིང་བ་སྤུའི་བུ་ག་ཐམས་ཅད་ནས་ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་དག་པ་དང་ལྡན་པའི་སྔོན་གྱི་སྦྱོར་བ་མང་པོའི་སྤྲིན་རབ་ཏུ་དགྱེ་བ་དང་། འཇིག་རྟེན་རྣམས་ལ་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཡོན་ཏན་དང་། ཡེ་ཤེས་མངོན་པར་ཤེས་པ་དང་ལྡན་པའི་ཡེ་ཤེས་ཀྱིས་རབ་ཏུ་བརྗོད་པ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་མཚན་མངོན་པར་ཤེས་པ་དང་ལྡན་པའི་ཡེ་ཤེས་ཀྱིས་མངོན་པར་བསྟན་པ་དང་། སྨོན་ལམ་ཐམས་ཅད་མངོན་པར་བསྒྲུབ་པའི་ཡེ་ཤེས་མངོན་པར་ཤེས་པ་དང་ལྡན་པའི་ཡེ་ཤེས་ཀྱིས་ཡོངས་སུ་བརྗོད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བསྡུ་བའི་སྨོན་ལམ་མངོན་པར་བསྒྲུབ་པའི་ཡེ་ཤེས་མངོན་པར་ཤེས་པ་དང་ལྡན་པའི་ཡེ་ཤེས་ཀྱིས་ཤིན་ཏུ་ཡངས་པར་བྱ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་བདག་མྱེད་པའི་རང་བཞིན་ལ་གཟུད་པ་མངོན་པར་ཤེས་པ་དང་ལྡན་པའི་ཡེ་ཤེས་ཀྱིས་རྣམ་པར་བསྟན་པ་དང་།
en: Sudhana also saw bodhisattvas issuing forth who were as numerous as the atoms in countless buddha realms, were filling the realm of phenomena in each instant of mind, and were teaching the field of knowledge to beings.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་རྒྱ་མཚོ་རྣམ་པར་བལྟ་བ་མངོན་པར་ཤེས་པ་དང་ལྡན་པའི་ཡེ་ཤེས་ཀྱིས་རབ་ཏུ་བརྗོད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབང་པོ་རྣམ་པར་དབྱེ་བའི་ཡེ་ཤེས་མངོན་པར་ཤེས་པ་དང་ལྡན་པའི་ཡེ་ཤེས་ཀྱིས་རབ་ཏུ་དབྱེ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་དང་མོས་པ་རྣམ་པར་བལྟ་བའི་ཡེ་ཤེས་མངོན་པར་ཤེས་པ་དང་ལྡན་པའི་ཡེ་ཤེས་ཀྱིས་ཡང་དག་པར་བརྗོད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལས་རྒྱ་མཚོ་ལ་འཇུག་པའི་ཡེ་ཤེས་མངོན་པར་ཤེས་པ་དང་ལྡན་པའི་ཡེ་ཤེས་ཀྱིས་རྣམ་པར་གྲོལ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྨོན་ལམ་རྒྱ་མཚོ་ལ་འཇུག་པའི་ཡེ་ཤེས་མངོན་པར་ཤེས་པ་དང་ལྡན་པའི་ཡེ་ཤེས་ཀྱིས་ཡོངས་སུ་བསྟན་པ་བྱེད་ཅིང་། སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ཆོས་ཀྱི་དབྱིངས་རྒྱས་པར་འགེངས་པ་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་མཐོང་ངོ་། །
en: They were emanating from all their pores the clouds of the many past practices by the tathāgatas of the pure perfection of knowledge; revealing to the world the level of knowledge that is the clairvoyant knowledge of the qualities of all the buddhas; teaching the level of knowledge that is the clairvoyant knowledge of the names of all the buddhas; elucidating the level of knowledge that is the clairvoyant knowledge of the accomplishment of all prayers; proclaiming the level of knowledge that is the clairvoyant knowledge of the accomplishment of the prayers for gathering all beings as pupils; proclaiming the level of knowledge that is the clairvoyant knowledge for bringing all beings to understand the nature of selflessness; teaching the level of knowledge that is the clairvoyant knowledge of seeing the ocean of the minds of all beings; explaining the level of knowledge that is the clairvoyant knowledge of the accomplishment of all prayers; categorizing the level of knowledge that is the clairvoyant knowledge that categorizes the faculties of all beings; describing the level of knowledge that is the clairvoyant knowledge that views the thoughts and aspirations of all beings; explicating the level of knowledge that is the clairvoyant knowledge that comprehends the ocean of the karma of all beings; teaching the level of knowledge that is the clairvoyant knowledge that comprehends the ocean of the prayers of all beings; and establishing beings in the perfection of knowledge.
